[
    {
        "id": 1,
        "name": "Keto Chicken & Green Beans Almondine Meal Prep",
        "image": [
            "chicken-green-bean-almondine-2.jpg",
            "chicken-green-bean-almondine-4.jpg",
            "chicken-green-bean-almondine-5.jpg"
        ],
        "description": "The first healthy meal I ever made for myself was grilled chicken breast with green beans and brown rice.  The chicken was previously frozen, the green beans were from a can and the brown rice was instant.  I didn’t really know what I was doing so I smothered the chicken with so much Mrs. Dash seasoning but by the time it finished cooking in the skillet, there was about 1 inch of water in the skillet and all of the seasoning had come off.  I still ate it though.",
        "tips": [
            "If you’d like to increase the abundance of the meal – while marginally increasing the carbohydrates – I recommend adding steamed or sautéed cauliflower rice with chopped onion.",
            "Swap in chicken thighs for chicken breasts to up the amount of fat to help meet individual caloric fat goals for meals.",
            "To make this a leaner low-carb recipe, simply use a total of 1 1/2 tablespoon olive instead of 3 tablespoons, and reduce the amount of sliced almonds for the green beans.",
            "Add some heat with cracked red pepper.",
            "Use lime or lemon juice for individual meal seasoning instead of copious amounts of salt."
        ],
        "ingredients": [
            "1 lb raw green beans",
            "1 lb chicken breast, tenders",
            "1 tablespoon olive oil",
            "1 1/2 teaspoons garlic powder"
        ],
        "steps": [
            "Bring a small amount of water to a simmer in a pot and add a steamer basket.  Add the green beans and steam until crisp-tender, about 5 minutes.  Once they are to your desired tenderness, remove the green beans from the steamer basket and add them to a bowl of ice water so they stop cooking and to preserve their vibrant green color.",
            "Add the chicken to a bowl and toss in the seasonings, and then rub it all over.",
            "Set a nonstick skillet on medium-high heat.  Once the skillet is hot, add the remaining olive oil then toss add the chicken.  Sear the chicken on the outside until golden brown, then reduce the heat to medium and cook through, about 6 to 8 minutes (if using tenders, a bit longer if using full chicken breasts).  Remove the chicken from the skillet.",
            "Reduce the heat to low-medium and add in the garlic and sliced almonds.  Fold the garlic and almonds in the oil and cook until the almonds are toasted, slightly brown.  Increase the heat to medium-high and toss in the green beans.  Toss and fold everything together until the green beans are warm again and the outside is slightly seared.",
            "Remove the green beans from the skillet and enjoy with the chicken!"
        ],
        "category": 1
    },
    {
        "id": 1,
        "name": "Maple Pecan Brussels Sprouts",
        "image": [
            "maple-brussels-sprouts-2.jpg",
            "maple-brussels-sprouts-3.jpg"
        ],
        "ingredients": [
            "1 cup chopped pecans, raw",
            "spray olive oil",
            "pinch of sea salt",
            "1 1/2 tablespoon avocado oil (or olive oil)"
        ],
        "steps": [
            "Set oven to 350F.",
            "Place pecans on a baking tray lined with parchment and spray with a little oil.  Dust with sea salt.  Bake for 12 to 15 minutes, or until golden brown (be careful not to burn).  Allow them to cool once baked.",
            "Bring a pot of water to boil and add Brussels sprouts.  Cook for 3 to 5 minutes until they turn a vibrant green color.  Upon piercing with a fork they should be crisp yet tender.  Immediately place the Brussels sprouts in a bowl of ice water so they stop cooking AND retain their brilliant green color.  Drain the bowl and pat them dry.  Slice them in half.  Again, it’s really important you pat the pieces dry.",
            "Set a nonstick skillet on HIGH heat.  Once the skillet is hot, add the oil and the Brussels sprouts.  Let the halves sear on one side, then shake the skillet to toss them.  Repeat this until the outside is brown and the edges are crispy.",
            "Add in the toasted pecans, followed by the syrup.  Toss the ingredients together in the pan for about 45 seconds, then immediately place in a bowl so they can cool and get somewhat sticky.  If desired, sprinkle on some sea salt."
        ],
        "category": 5
    },
    {
        "id": 1,
        "name": "Quick Carrot Cake Protein Oatmeal",
        "image": [
            "carrot-cake-protein-oatmeal-2.jpg",
            "carrot-cake-protein-oatmeal-1.jpg"
        ],
        "description": "Here’s a quick recipe to spruce up your morning pr-oats, or protein oatmeal, routine! One thing I’d like to highlight is why I do not recommend cooking oatmeal WITH protein powder.  Simply put – protein dries it out and slightly changes the flavor and texture of the oatmeal. As an alternative, I recommend cooking the oatmeal separately with water and leaving it slightly dry and chunky, almost like a paste.  Why?  Because we’re going to add milk and protein powder to it. Once you stir in the protein-milk mixture, you’re left with a smoother, more creamy texture WHILE keeping the flavor of the protein and texture of the oatmeal intact.   This method is especially useful as a quick, on-the-go option.  Try it out and see for yourself!",
        "ingredients": [
            "1/2 cup dry oats cooked with water",
            "1 scoop vanilla whey protein powder",
            "3 oz almond milk (unsweetened)",
            "2-3 tablespoons grated carrots"
        ],
        "steps": [
            "Cook up some oats using water and set aside.  Note: they should be slightly dry and thick after cooking – do not worry about that.",
            "In a shaker bottle, mix/shake almond milk and protein powder vigorously until well-mixed. Add to the serving of oatmeal and mix together.",
            "Then add the remaining ingredients and stir and mix together.  If desired, you can warm up the oatmeal again in the microwave.  And to lessen the amount of carbohydrates, simply use less maple syrup.",
            "Enjoy!"
        ],
        "category": 5
    },
    {
        "id": 1,
        "name": "Fried Rice With Brussels Sprouts",
        "image": [
            "brussels-sprouts-fried-rice-chicken-1.jpg",
            "brussels-sprouts-fried-rice-chicken-2.jpg"
        ],
        "ingredients": [
            "1/2 lb Brussels sprouts, halved or quartered",
            "1 tablespoon avocado oil (or other oil with a high smoke point such as grapeseed, tigernut or coconut; if not olive oil)",
            "pinches of sea salt & cracked pepper",
            "1 tablespoon olive oil"
        ],
        "steps": [
            "If you do not have cooked rice, cook rice according to the instructions given.  Then allow it to cool to room temperature or place in the fridge.",
            "Set oven to 420F.",
            "In a large bowl, mix together cut Brussels sprouts, olive oil and sea salt & pepper.  Toss the sprouts so they are completely covered then dump them on a baking tray lined with parchment paper.  Bake for 15-20 minutes or until the edges are brown and crispy, and the sprouts are crisp-tender when pierced with a fork.",
            "Set a nonstick skillet on medium heat and once hot, add the olive oil, garlic and green onion.  Sauté for 2 to 3 minutes and be careful not to burn the garlic.",
            "Add in the room temperature, OR cold, cooked brown rice and cook in the skillet for 2 minutes. Then, add bell peppers and the roasted Brussels sprouts.  Fold everything together, then season with low-sodium soy sauce and chopped cilantro.",
            "Mix everything together and reduce the heat to low.  Drizzle sesame oil over the rice, gently fold and then serve.",
            "Enjoy with your choice of protein!  Here in this example, I enjoyed mine with grilled chicken breast seasoned with garlic, onion, thyme and sea salt & pepper."
        ],
        "category": 5
    },
    {
        "id": 1,
        "name": "Chipotle Walnut & Vegan Black Bean Burger",
        "image": [
            "walnut-bean-burger-5.jpg",
            "walnut-bean-burger-4.jpg",
            "walnut-bean-burger-2.jpg",
            "walnut-bean-burger-6.jpg"
        ],
        "ingredients": [
            "2 tablespoons milled flax (mixed with 3 tablespoons water)",
            "1 tablespoon minced garlic",
            "1/2 cup onion (red or white)",
            "1/2 cup (~56g) raw walnuts",
            "1 can (15oz) no-salt added black beans, rinsed and drained"
        ],
        "steps": [
            "Mix together the milled flax and water and set aside.",
            "Set a nonstick skillet on medium heat.  Once it’s hot, spray with olive oil then add garlic and onion.  Caramelize for 3 to 5 minutes, or until golden brown and somewhat translucent, and be careful not to burn the garlic.",
            "Add the onions to a food processor, along with raw walnuts.  Blend for about 1 minute until minced.",
            "Then add only HALF of the black beans and then the remaining ingredients – except for the flax egg and oat. Blend for 1 to 2 minutes until well combined.",
            "Lightly mash the remaining black beans together in a bowl using a fork to create some texture for the burger.  Then add the bean mixture, flax egg and raw oats.   Mix everything together well, then season to taste with sea salt & pepper.  Cover the bowl with plastic wrap then place in the fridge for 20 minutes.",
            "Batter too wet?  add tablespoons of raw oats",
            "Batter too “crumbly”?  Add another flax egg (1 tablespoon milled flax set in 1.5 tablespoon water)",
            "Form four equal sized patties, then place the patties in the freezer for 20 minutes to set.  This will help them retain their form when cooking.",
            "Set a nonstick skillet on medium heat and once hot, generously spray with olive oil.  Add the patties and cook for 6 to 8 minutes on each side, or until the outside edges of the patty turn brown and slightly crispy.",
            "Enjoy the patty with a fresh salad or as a delicious postworkout hamburger."
        ],
        "category": 5
    }
]