[
    {
        "id": 1,
        "name": "Dumbbell Pullover",
        "image": "dumbbell-pullover.png",
        "description": "Some people would contend this exercise doesn’t belong on a top-10 list for chest. They’ll either swear up and down that it trains the back, or they’ll belittle it as a relic once revered but now relegated to the training scrap heap because of its potential danger to the shoulders. ",
        "main_area_targeted": "pectorals, latissimus dorsi, serratus",
        "strength": "Most chest exercises fall into one of two categories: They involve pressing a weight (bending and extending at the elbows) or doing a flye motion (keeping your elbows fixed and closing and opening your arms in front of your body). The pullover is one of a scant few options that work the chest at a completely different angle, in a top-to-bottom contraction. ",
        "how_to": "Lie on a bench with your upper back, head and neck supported and your feet flat on the floor. Hold a dumbbell with your arms extended above your face. Maintaining just a slight bend in your elbow throughout, slowly lower the dumbbell backward, allowing your elbows to come to a point at which they align with your ears. When you’ve stretched as far as you can without bending your elbows, flex through your chest and lats to reverse direction to bring the dumbbell back overhead.",
        "level": 1,
        "category": 1
    },
    {
        "id": 2,
        "name": "Push-Up",
        "image": "push-up.jpg",
        "description": "Your drill instructor was a son of a you-know-what, but he was on to something when he screamed, “Drop and give me 20!” The quintessential bodyweight exercise is nearly perfect in its simplicity. “The push-up is a great standard exercise because it requires one piece of equipment — you,” says fitness expert Levi Harrison, M.D., orthopedic surgeon and author of The Art of Fitness: A Journey to Self-Enhancement. “This exercise targets the triceps, pectoralis major, deltoids — especially the anterior portion — and the serratus anterior. When properly done, the push-up also can engage your core muscles effectively.”",
        "main_area_targeted": "pectorals (Note that you can change the emphasis depending on your angle: With feet and hands on the floor, you’ll take aim at the midpecs; elevating your feet on a bench focuses on the upper pecs; and putting your hands on a bench with your feet on the floor hits the lower pecs.)",
        "how_to": "Sit with your lower back fully in contact with the pad and your feet flat on the floor. With your elbows at 90-degree angles and forearms flush against the pads, move your arms slightly forward to disengage the weight from the stack. From here, deliberately flex your pecs to bring the handles out in an arc until they meet in front of your body. Squeeze hard, then slowly return to the start, stopping when your upper arms are even with your torso, and repeat.",
        "strength": "Ever try to pack a set of dumbbells and a bench in a suitcase? (Don’t laugh. Many a gym rat about to go on a trip has contemplated it.) Thing is, most exercise equipment is hard to lug around. Weights are heavy — by design, of course. The answer to staying fit on the road is, in part, using your own body as resistance. Push-ups can be done in hotel rooms, parks, prison cells ... anywhere you have solid ground to work with.",
        "level": 1,
        "category": 1
    },
    {
        "id": 3,
        "name": "Pec-Deck Flye",
        "image": "pec-deck-flye.jpg",
        "description": "First, a clarification: When we say “pec-deck flye,” we are referring specifically to the version in which you bend your arms 90 degrees and put your elbows on pads. The other variant — in which you hold handles and your elbows roam free, which we refer to as a “machine flye” in this magazine — is certainly a fine exercise, but in our opinion, not quite on the same level. Why? The pec-deck places better focus on the all-important squeeze when you bring your arms in front of your body, causing the muscle fibers at the center of your breastplate to spring to full attention.",
        "main_area_targeted": "middle pecs",
        "how_to": "Sit with your lower back fully in contact with the pad and your feet flat on the floor. With your elbows at 90-degree angles and forearms flush against the pads, move your arms slightly forward to disengage the weight from the stack. From here, deliberately flex your pecs to bring the handles out in an arc until they meet in front of your body. Squeeze hard, then slowly return to the start, stopping when your upper arms are even with your torso, and repeat.",
        "strength": "When performed correctly, with arms in constant contact with the pads — a mental trick is to think of leading with your elbows — the pec-deck pits your pectorals directly against resistance while offering a broad range of motion and a reduced risk of injury when compared with free weights.",
        "level": 2,
        "category": 1
    },
    {
        "id": 4,
        "name": "Decline Bench Press",
        "image": "decline-bench-press.jpg",
        "description": "No self-respecting bodybuilder or exercise physiologist would dare suggest the decline bench press is equal to its two more celebrated siblings, the incline and flat bench press. But that doesn’t make it a black sheep. It still targets the pectorals, although the focus is on the lower-pec area rather than the more prominent and more aesthetically critical upper and middle regions.",
        "main_area_targeted": "lower pecs",
        "how_to": "Lie on a decline bench. Your torso should be fully supported from your head to your hips, with your knees bent and feet harnessed behind roller pads. Grasp the bar with a wide, overhand grip. Bend your arms and slowly lower the bar toward your lower chest. When the bar reaches chest level, forcefully extend your arms, elevating the bar back to the starting position.",
        "strength": "Although the lower pecs are targeted to an appreciable degree by flat bench presses, the decline is a direct way to chip away at them. It’s not all that necessary for beginners, but if you’re fine-tuning a developed physique, it’s undeniably helpful.",
        "level": 2,
        "category": 1
    },
    {
        "id": 5,
        "name": "Incline Bench Press",
        "image": "incline-bench-press.jpg",
        "description": "It’s not fatal, but if you’ve been diagnosed with meaty middle pecs and flat upper pecs, you’re all too aware how embarrassing a condition it is. However, if you can stomach the medicine, the ever-challenging incline bench is your remedy.",
        "main_area_targeted": "upper pecs",
        "how_to": "Lie on an incline bench set at 30 to 45 degrees and place your feet flat on the floor for support. Grasp the barbell with an overhand grip just outside shoulder width and unrack it, holding it directly over your upper pecs. Slowly lower the bar to your upper chest, touching down for a brief count before powerfully pressing it back to full elbow extension.",
        "strength": "Trying to build a huge chest without pressing is like trying to hit a Justin Verlander fastball with a Wiffle ball bat. Sure, you can attempt it, but your chances of success are slim. It is without equal among chest exercises for its combination of direct engagement of the upper pecs and the total resistance you can place on those muscles",
        "level": 1,
        "category": 1
    },
    {
        "id": 6,
        "name": "Standing Cable Curl",
        "image": "standing-cable-curl.jpg",
        "description": "You’ll notice a decided pattern in this list. Truth is, when it comes to biceps, the only way to directly engage them is to bend your elbows. So outside of compound moves such as rows and pulldowns for your back that also engage your bi’s, and isometric exercise in which you simply hold a contraction, training biceps is all about curling. This particular curl involves a cable and your choice of attachment, from a straight or cambered bar to a rope or even a D-handle if you train one arm at a time.",
        "main_area_targeted": "Biceps brachii, with brachialis activation if using a rope",
        "how_to": "Stand holding a bar attached to a low-pulley cable with an underhand grip, elbows extended. Keep your abs tight, chest up and head straight as you contract your biceps to curl the bar toward your chest, keeping your elbows at your sides throughout. Hold and squeeze the contraction at the top, then slowly return the bar along the same path. Repeat for reps without letting the weight stack touch down between reps.",
        "strength": "This exercise boasts the same primary benefit as high-cable curls: the constant tension provided by the cable. However, it gains a slight edge because it offers the ability to work against more total resistance and your elbows are in a mechanically stronger position at your sides.",
        "level": 1,
        "category": 3
    },
    {
        "id": 7,
        "name": "Smith-Machine Drag Curl",
        "image": "smith-machine-drag-curl.jpg",
        "description": "The Smith machine isn’t often associated with curling. The fixed straight-up-and-down path of the bar makes a typical curl awkward, since the proper range of motion involves a natural arc. However, this particular variation calls for a direct line of pull along your body.",
        "main_area_targeted": "Biceps and brachialis, with emphasis on strength",
        "how_to": "Stand inside a Smith machine holding the bar in front of your upper thighs, with your chest up, shoulders back and eyes focused straight ahead. Begin by shifting your elbows back and bending them to curl the bar toward your upper abs. As the name suggests, you’ll actually drag the bar up your torso, keeping your elbows behind you the entire time. Upon full contraction, return the bar along the same path and repeat.",
        "strength": "The Smith machine is much maligned by some exercise experts because it eliminates many advantages of the free-weight barbell. By placing the bar on a smooth, lubricated track and removing any need to balance the weight as you lift, you automatically deduct some benefit from the motion. Yet that subtraction can also be a plus, as it allows you to concentrate solely on working the intended muscle — in this case, the biceps — while likely handling a touch more poundage overall.",
        "level": 1,
        "category": 3
    },
    {
        "id": 8,
        "name": "Seated Alternating Dumbbell Curl",
        "image": "seated-alternating-dumbbell-curl.jpg",
        "description": "The first free-weight move on our list has been a gym favorite for decades, from both standing and seated positions. The latter wins out for the purposes of this list, as we explain below.",
        "main_area_targeted": "Biceps and brachialis, emphasizing the full length of the muscle",
        "how_to": "Sit on a low-back bench, holding a dumbbell in each hand at your sides. Keeping your chest up, curl one weight toward the same-side shoulder, squeezing your biceps hard at the top, then lower to the start. Repeat with the other arm. You can either condense the set by lowering one dumbbell as you lift the other, or take it slower by moving through one full rep per side, going all the way up and down with one arm before switching to the other.",
        "strength": "The rhythmic nature of alternating dumbbell curls — curling one weight up as you lower the other, switching back and forth for reps — makes it a great companion with barbell and EZ-bar curls. Here, a stronger side can’t compensate for a weaker one as it can when using a bar. Doing them seated instantly knocks potential momentum out of the move, preventing you from rocking your body to help swing the dumbbells upward.",
        "level": 1,
        "category": 3
    },
    {
        "id": 9,
        "name": "Dumbbell Concentration Curl",
        "image": "dumbbell-concentration-curl.jpg",
        "description": "It may be only No. 6 in this ranking, but it can be argued that there’s no more satisfying biceps exercise than the concentration curl. Working one arm at a time, curling under full control, tends to really inflate your muscle pump, flushing the fibers with nutrient-rich blood.",
        "main_area_targeted": "Biceps, with emphasis on the peak",
        "how_to": "Sit at the end of a flat bench or use a short-back chair. Bend over and grasp a dumbbell with an underhand grip, locking your working arm against your same-side inner thigh. Place your nonworking hand on your leg for balance. Moving only at your elbow, curl the weight as high as you can toward your torso. Squeeze your biceps at the top before lowering the dumbbell back to the start, but don’t let it rest on the floor between reps.",
        "strength": "This exercise, like any full-range-of-motion curl, stimulates the biceps from each end to the peak in the center. But the positioning of the resistance against gravity and the ability to really zero in on one arm at a time allows for extra emphasis on the short, inner head of the biceps. Arnold Schwarzenegger has famously suggested imagining that your bi’s are huge mountains as you flex, and such mental imagery can help accentuate the contraction.",
        "level": 1,
        "category": 3
    },
    {
        "id": 10,
        "name": "Scott Curl",
        "image": "scott-curl.jpg",
        "description": "While the preacher bench was designed to put your upper arms on the angled side of the pad, bodybuilders soon discovered that reversing that action — leaning over the pad and placing the upper arms along the flat side — allows you to work directly against gravity’s direction of pull.",
        "main_area_targeted": "Biceps, with emphasis on the short, inner head",
        "how_to": "Grasp a barbell or EZ-bar and lean your chest against the angled side of a preacher bench, keeping your back tight and knees slightly bent. (You can also use a dumbbell and train one arm at a time.) Make sure your armpits fit securely against the top of the pad, with your triceps pressed into the flat side of the bench. Hold the bar straight toward the floor with a supinated (palms-up) grip. With your head neutral and eyes focused forward, curl the weight in a smooth arc, squeeze your biceps hard for a one-count, and slowly lower back to the nearly elbows-straight position.",
        "strength": "The Scott curl is similar to a barbell curl in that you bring the bar from a position where your arms are pointed straight toward the floor to fully flexed at the top. But with your armpits tucked tight against the top of the preacher bench and your chest resting against the pad, cheating via a swing of the hips is impossible. That makes it you against the weight, with no momentum to lend an assist.",
        "level": 1,
        "category": 3
    },
    {
        "id": 11,
        "name": "Cable Reverse Flye",
        "image": "cable-reverse-flye.jpg",
        "description": "Exercises that specifically target the rear head of the deltoid muscle pop up three times on this list, and with good reason — the rear delts don’t tend to get much attention. But for shoulders that will fill out your T-shirts, you’re gonna need rear delts that can keep pace with the meaty front and middle delts. Those latter two get additional work during chest and shoulder presses, while the rears really need ample attention of their own to thrive. For that, the reverse flye comes to the rescue, adding a dimension of muscle control and balance that the more popular reverse pec-deck flye cannot match.",
        "main_area_targeted": "rear deltoids",
        "how_to": "Attach D-handles to the upper pulley of a cable machine. Now grasp the left-side handle in your right hand, then step over and get the right-side handle in your left before stepping to the center, equidistant from each stack. Straighten your elbows without locking them out, your palms in a neutral grip. From here, keeping your arms elevated at the level of your shoulders and elbows fixed, open your arms out to your sides, pulling each handle across to the other side by engaging your rear delts. When you reach a point at which your arms are outstretched in a “open hug” pose, reverse the motion to bring the handles back to the start position. Know that one hand will cross over the other when in front — it doesn’t matter which is high and which is low, although you can switch from set to set if you prefer.",
        "strength": "Like all cable-based moves, the key attribute is continual tension on the muscles being worked. Unlike dumbbells, barbells and some machines, on which the tension eases at certain points of the range of motion because of gravity and inertia — with cables, the resistance is always counter-pulling, in this case meaning your rear delts never get a break as you rep.",
        "level": 1,
        "category": 4
    },
    {
        "id": 12,
        "name": "Bent-Over Dumbbell Lateral Raise",
        "image": "bent-over-dumbbell-lateral-raise.jpg",
        "description": "Some would argue that the one-arm bent-over lateral raise — allowing you to focus all your effort on one side at a time — is superior to the two-armed version. We disagree. The unilateral version increases the ability to cheat, allowing you to rotate more at the waist when repping. Doing both arms at the same time cuts down on that kind of momentum, putting more pressure on your rear delts to carry the load.",
        "main_area_targeted": "rear deltoids",
        "how_to": "With a dumbbell in each hand and your chest up, back flat, knees slightly bent and eyes fixed on a point on the floor just ahead of you, bend over at the hips until your torso is nearly parallel to the floor. Let the dumbbells hang directly beneath you with your elbows fixed in a slightly bent position. From there, powerfully raise the dumbbells up and out to your sides in an arc until your upper arms are about parallel with the floor. Pause at the top for a squeeze, then lower the dumbbells back along the same path, stopping just before your arms go fully perpendicular to the floor, and start the next rep.",
        "strength": "The bent-over raise is versatile and can be performed either standing or seated at the end of a flat bench leaning over your knees. And the use of dumbbells means other muscles come into play for stabilization — which may not mean a heck of a lot for your rear delts but does help create a more functional physique overall.",
        "level": 1,
        "category": 4
    },
    {
        "id": 13,
        "name": "One-Arm Cable Lateral Raise",
        "image": "one-arm-cable-lateral-raise.jpg",
        "description": "For those of you already fretting that this list has begun with three isolation movements instead of major compound exercises, take note — the shoulder is a smaller muscle group that benefits greatly from such targeted weaponry. The thing is, presses tend to lean most heavily on the anterior (front) delt, leaving the side and rear heads slightly less stimulated. That’s not to say presses aren’t ideal in many ways (as you’ll see as you keep reading), but for complete shoulders, you also want to exhaust each head on its own. And when it comes to the middle delt, nothing beats a lateral raise.",
        "main_area_targeted": "middle deltoids",
        "how_to": "Stand sideways to a low cable pulley with your feet shoulder-width apart, holding a D-handle in the hand opposite the pulley. Your nonworking arm can be on your hips or braced on the pulley structure. Keep your abs tight, chest up and shoulders back and, without engaging momentum, raise the cable out to your side in a wide arc, keeping your elbow and hand moving together in the same plane. When your arm reaches a point just above shoulder level, hold it momentarily as you contract the delt, then slowly lower down along the same path, stopping before the weight stack touches down. Finish all reps on that side before switching to the other.",
        "strength": "Just like the cable reverse flye, the cable here offers constant tension, in this case right on the prominent middle delt that splits the center of the deltoid muscle. The ease of switching between resistance via the pin on the weight stack also makes cable raises ideal for drop sets to failure. For a different feel, you can try these with the cable running behind your back instead of across the front of your body.",
        "level": 1,
        "category": 4
    },
    {
        "id": 14,
        "name": "Cable Front Raise",
        "image": "cable-front-raise.jpg",
        "description": "You could take the first four moves in this list, throw ’em in a bag and dump them out in any order you wish. Doesn’t matter — they’re all about equal in their benefits for the respective delt head they target. In the case of the cable front raise, you’ll call on the anterior delt to take on the load, benefiting again from that continuous tension the cable provides. One caveat: If your shoulder workout is heavy on presses, you’ll want to prioritize the lateral and rear-delt raises, but from a purely muscle-sculpting perspective, the cable raise to the front is brutally effective.",
        "main_area_targeted": "anterior (front) deltoids",
        "how_to": "With a D-handle in one hand, stand in a staggered shoulder-width stance with your back to a low cable pulley. Place your nonworking hand on your hip for balance. With your chest elevated, back flat and knees slightly bent, powerfully raise the cable up and out in front of you until your upper arm is about parallel with your working shoulder. Squeeze, then slowly lower your arm back to the start position (without letting the stack touch down) and repeat. Do all reps on one side before switching to the other.",
        "strength": "The placement of the cable in side laterals across your body can cause some awkwardness because of the drag. That’s eliminated with front raises, which allow the cable to roam free during the range of motion. It’s a small benefit, sure, but it eliminates a minor distraction when repping.",
        "level": 1,
        "category": 4
    },
    {
        "id": 15,
        "name": "Push Press",
        "image": "push-press.jpg",
        "description": "Heavy-compound-exercise fans — here you go. The push press is an absolute powerhouse, combining a heavy overhead action with just enough momentum to handle serious challenging loads. It makes an effective leadoff exercise for a mass-gain-focused shoulder workout, as long as you make sure to start light (with the naked bar, even) to get thoroughly warmed up before stepping up to the big-boy poundage.",
        "main_area_targeted": "anterior and middle deltoids",
        "how_to": "To get into position, either clean a loaded barbell from the floor to shoulder level or take it off pins in a power rack. Hold the bar with an overhand grip, palms up and elbows pointed forward, your upper arms near parallel with the floor as the bar rests at a point atop your upper chest. From a standing position, lower your hips and bend your knees to dip down into a quarter squat. Now recoil to explosively drive upward with your legs as you extend your arms and lift the bar overhead to full elbow extension. Hold the bar there briefly, then lower it back to its resting position on your upper-chest area and descend into the next rep.",
        "strength": "The push press is a closed-kinetic-chain exercise, meaning the legs remain on the floor (a fixed surface). The motion calls on multiple muscle groups, from your legs to your shoulders to your arms, to work synergistically, introducing functional components to what otherwise may be a very bodybuilding-centric workout routine. In other words, movements like the push press help ensure your muscles aren’t just all show and no go when it comes time to actually use them in your daily life.",
        "level": 1,
        "category": 4
    },
    {
        "id": 16,
        "name": "Leg Press",
        "image": "leg-press.jpg",
        "description": "First, let’s talk about what many trainers hate about the leg press: It can cause lower-back injury when done incorrectly. And when guys load every last plate in the gym on the sled and try to half-ass a few reps out, with their lower back disengaging from the pad on every rep in part due to woefully inflexible hamstrings and glutes, that’s about as incorrect as you can get. It’s true that it’s one of the most abused exercises in the gym — probably because you can feel like a big shot and handle much more weight than you can on a squat — but used carefully, the leg press can be very beneficial. And just as important, it helps provide variety in what might otherwise be a very squat-centric leg program.",
        "main_area_targeted": "Quadriceps (emphasized with feet lower on platform and closer together), glutes and hamstrings (emphasized with feet higher and wider on platform)",
        "how_to": "Sit squarely in the leg press machine and place your feet shoulder-width apart on the sled. Keeping your chest up and lower back pressed into the pad, carefully unlatch the sled from the safeties. Bend your knees to lower the platform, stopping before your glutes lift off the pad. From there, powerfully extend your knees to press the weight up (but don’t lock them out at the top).",
        "strength": "The leg press is a closed-kinetic-chain exercise, which simply means your feet are planted rather than free. A closed chain provides for a stronger base of power without as much shearing force on the knee joint as can occur in an open-chain exercise like the knee extension, which didn’t make the list for that very reason.",
        "level": 1,
        "category": 5
    },
    {
        "id": 17,
        "name": "Step-Up",
        "image": "step-up.jpg",
        "description": "This is arguably one of the more functional exercises on this list. After all, you probably walk up stairs on a fairly regular basis, right? Being a unilateral exercise, it also means a stronger leg can’t compensate for a weaker one, with each leg taking its turn absorbing the full brunt of the motion.",
        "main_area_targeted": "Quadriceps, glutes",
        "how_to": "Hold a dumbbell in each hand in front of a knee- to hip-high step, bench or platform. Starting with your feet in a shoulder-width stance, step forward with one leg onto the platform and drive through that thigh to propel your body upward. Bring your trailing leg up and stand atop the platform, then step back with either leg to return to the floor. You can either repeat with the same leading leg for all reps and then switch or alternate your lead leg from step to step.",
        "strength": "The step-up comes in all sorts of variations and can be adjusted to challenge beginners and advanced athletes alike. To provide the resistance, you can hold a barbell, dumbbells or kettlebells (either at your sides or racked at shoulder level), wear a weight vest or just go with your own bodyweight. Step up onto a platform ranging from a height halfway up your shin to where your thigh is parallel to the floor in the start position. Not only does this develop power through the glutes, hips and thighs, but it also helps you practice balance and jumping force, which is helpful if you’re in a sport that requires vertical hops.",
        "level": 1,
        "category": 5
    },
    {
        "id": 18,
        "name": "Hack Squat",
        "image": "hack-squat.jpg",
        "description": "While the barbell version of the hack squat — picking up a barbell placed behind you — is perfectly acceptable, especially for those training at home, the typical machine-based hack squat you find at most gyms is our choice here. That’s the one that’s plate-loaded and angles your body slightly backward. Within the confines of the machine, you’ll find a bit more safety than you would with the free-weight squat, which becomes more crucial as you tire during a workout. That means hacks are a great mid-workout option, serving as a bridge between squatting and other moves such as the leg press and lunge.",
        "main_area_targeted": "Quads and glutes primarily, hamstrings secondarily",
        "how_to": "This exercise is done in a weight-bearing functional position just like a standing squat,” Flores points out. “The hack squat machine also allows you to go a little heavier without sacrificing too much form as you would performing bar squats since your back is supported, which decreases the chance of injury. That’s important when the goal is to increase mass and strength.",
        "strength": "Step inside a hack squat machine, placing your shoulders and back against the pads. Set your feet at mid-platform just inside shoulder width, keeping your feet flat throughout the exercise. With your chest up and core tight, unhook the safeties and slowly lower yourself, stopping when your thighs are just past parallel to the platform. From here, powerfully press upward to the start position, keeping your knees bent slightly at the top to protect them from hyperextension. “When performing any squat movement, my cues are always to avoid any excessive internal or external rotation at the knees — think the ‘knock-knee’ position or knees and toes pointing out — along with keeping your knees about shoulder-width apart throughout the movement,” Flores instructs. “The weight should be felt in your heels, not your toes.”",
        "level": 1,
        "category": 5
    },
    {
        "id": 19,
        "name": "Pistol Squat",
        "image": "pistol-squat.jpg",
        "description": "Admittedly, you’ll probably feel like an idiot when learning this move. You’ll fall on your can in the bottom position and likely lose your balance repeatedly. You won’t even be able to get all the way down into a full squat at first. We can only urge you, however, to not give up: Those who master this exercise have a tremendous weapon in their leg-training arsenal, and it doesn’t require a lick of equipment.",
        "main_area_targeted": "Quads, hamstrings, glutes",
        "how_to": "Begin in a standing position. Extend one leg straight out in front of you, balancing on your other foot. From here, squat all the way down by lowering your hips and glutes straight toward the floor, bending your knee until your working thigh is below parallel. At the bottom, your nonworking leg and arms will be out in front of you for balance with your planted foot flat on the floor. Drive through that heel to return to a standing position, making sure to never let that heel come up as you rep.",
        "strength": "Sure, this is more about dynamic performance than pure muscle building, but no matter. Consider this the functional cousin of No. 9 above and remember: The more functional you are, the better you’ll be at mastering any exercise or physical activity. You may find that your quads burn deep for days after you first try the pistol squat, which is a sure sign that you’ve been shortchanging your range of motion on traditional leg exercises for years.",
        "level": 1,
        "category": 5
    },
    {
        "id": 20,
        "name": "Walking Lunge",
        "image": "walking-lunge.jpg",
        "description": "Lunges come in more varieties than Taylor Swift breakup songs. You can do stationary lunges in any direction — front, side, backward or any point in between — and have a damn fine exercise on your hands. But walking lunges ultimately made our list because a) they’re slightly more functional since you continually move forward instead of standing still and b) they provide an excellent finisher to any leg workout. No less than eight-time Mr. Olympia Ronnie Coleman used to take a loaded barbell outside and lunge through the Metroflex Gym parking lot in the Texas heat to cap his leg day, which with thighs as big as 36 inches around in his heyday was a sight to behold.",
        "main_area_targeted": "Quads, hams, glutes",
        "how_to": "Holding dumbbells in each hand, step forward with one foot. Bend both knees to lower your torso toward the floor, making sure your front knee doesn’t pass your toes at the bottommost position. Stop just short of your rear knee touching the floor, then drive through the heel of your front foot while bringing your rear leg forward until you return to a standing position. Then step with the opposite leg into a lunge, repeating the pattern. Continue alternating down the floor. “The cues I utilize when teaching this movement are to always have your core engaged, with a neutral spine or slight lordosis (extension),” Flores says. “Most important, do not let the front knee turn in or out excessively.”",
        "strength": "The walking lunge is a dynamic movement, requiring coordination and muscle recruitment to perform correctly,” explains Gene Flores, CSCS, a physical therapist and orthopedic clinical specialist at Vargo Physical Therapy, an outpatient clinic in Reseda, Calif. “This exercise is predominantly a unilateral activity no matter which way it’s performed, with emphasis on the front rather than the back leg. You’ll get a good amount of co-contractions from above and below the knee joint, from the hip and core to the ankle and foot.",
        "level": 1,
        "category": 5
    },
    {
        "id": 21,
        "name": "Pull-Up",
        "image": "pull-up-back.jpg",
        "description": "Forget the push-up. The pull-up, which calls on more pure strength and calls on more muscles throughout the kinetic chain (the series of joints from your torso to your extremities) is the ultimate test of strength when it comes to using your own bodyweight as resistance.",
        "main_area_targeted": "upper and middle back (rhomboids, lats, teres major and minor, infraspinatus, middle and lower trapezius)",
        "how_to": "Grasp a fixed overhead bar with a wide overhand grip, wrapping your thumbs around the bar. Hang freely from the bar, arms fully extended and ankles crossed behind you. Contract your lats to raise your body upward, concentrating on keeping your elbows out to your sides and pulling them down to your flank to raise yourself. Hold momentarily as your chin crosses the level of the bar and then lower yourself down to the dead-hang, elbows-extended position.",
        "strength": "The latissimus dorsi muscle group can produce a tremendous amount of contractile force and strength,” explains Daryl Conant, CSCS, owner of the Fitness Nut House in Kennebunk, Maine, and creator of the AB Inferno exercise system. “In addition, the large tissue mass can metabolize significant amounts of glycogen [glucose] and fat. Very seldom do you see a person who has a well-defined muscular back have excess abdominal fat.",
        "level": 1,
        "category": 2
    },
    {
        "id": 22,
        "name": "Bent-Over Barbell Row",
        "image": "bent-over-barbell-row.jpg",
        "description": "Give a man nothing but a barbell, weights and plenty of protein, water and veggies, and you can build a world-class bodybuilding physique. One of the exercises he’ll surely do is the bent-over barbell row, which will expand the back in every direction, from the inner musculature out to the edge of the lats. It’s a can’t-miss, all-in-one powerhouse of a motion.",
        "main_area_targeted": "midback (rhomboids, lats, teres major and minor, infraspinatus, middle and lower trapezius)",
        "how_to": "Standing with your feet shoulder-width apart and knees slightly bent, grasp a barbell with a wide, overhand grip. Lean forward at your hips until your torso is roughly parallel with the floor. The barbell should hang straight down in front of your shins. Without raising your upper body, pull the barbell up toward your abdomen, bringing your elbows high and above the level of your back. Hold the bar in the peak-contracted position for a brief count, then slowly lower along the same path.",
        "strength": "In electromyography studies (EMG for short), which measures activation in a muscle group during an exercise, the bent-over row scores consistently high, along with one-arm dumbbell rows and T-bar rows. This means that the exercise serves its intention well, calling on a synergistic cavalry of muscles to fire as you bring the bar to your stomach.",
        "level": 1,
        "category": 2
    },
    {
        "id": 23,
        "name": "Pulldown",
        "image": "pulldown.jpg",
        "description": "The apparatus is ubiquitous in gyms worldwide, and rightfully so: The pulldown machine pinpoints the lats, helping forge width and depth that make the very best developed backs visible from the front. (In competitive bodybuilding terms, think front-lat spread.)",
        "main_area_targeted": "outer back (lats)",
        "how_to": "Sit at a lat pulldown machine so the bar is directly overhead or slightly in front of your body. Adjust the pads so that your quads fit snugly over your thighs. Grasp the angled ends of the pulldown bar with a wide, overhand grip. With your abs tight, back slightly arched and feet flat on the floor, pull the bar down to your upper chest, your elbows back and pointed out toward the sides in the same plane as your body. Squeeze and hold for a brief count before slowly allowing the bar up along the same path. Don’t let the stack touch down between reps.",
        "strength": "Like the seated cable row, you can use a rotating array of handles and grip styles. This exercise also works the back at an important angle — while many back exercises involve a rowing motion, the pulldown operates in the vertical plane as you pull from above your head.",
        "level": 1,
        "category": 2
    },
    {
        "id": 24,
        "name": "One-Arm Dumbbell Row",
        "image": "one-arm-dumbbell-row.jpg",
        "description": "If you haven’t noticed a pattern yet, you will by the time this list is complete — any number of rowing movements, whether dumbbell, barbell, cable or machine, are as essential to back training as the interest of paparazzi are to a Kardashian’s self-esteem.",
        "main_area_targeted": "midback (rhomboids, lats, teres major and minor, infraspinatus, levator scapulae, trapezius)",
        "how_to": "Place one knee and the same-side hand on a flat bench with your other foot planted alongside. In your free hand, hold a dumbbell in the air, arm hanging straight down toward the floor. Now, pull the dumbbell up toward your flank — your elbow should bend and extend above the plane of your back as you shift your shoulder blade inward for a complete contraction. Then lower the ’bell along the same path. Repeat for reps, then switch arms.",
        "strength": "Versus a barbell row, the dumbbell variation allows for a more extensive range of motion while not allowing a stronger lat to compensate for a weaker one.",
        "level": 1,
        "category": 2
    },
    {
        "id": 25,
        "name": "Straight-Arm Pulldown",
        "image": "straight-arm-lat-pull-down.jpg",
        "description": "The straight-arm pulldown is a rarity in the back-exercise arsenal in that it’s essentially a single-joint movement. In other words, unlike compound rowing-type moves that call on assistance muscles to complete a lift, the straight-arm pulldown pinpoints the lats as the main mover. This makes it a versatile addition to round out almost any back routine.",
        "main_area_targeted": "outer back (lats)",
        "how_to": "Stand behind the bench of the lat pulldown machine with your feet shoulder-width apart. Grasp the lat bar with your hands shoulder-width apart. Keeping a slight bend in your elbows, contract your lats to pull the bar straight down toward your thighs. Hold that contraction for a moment, then return the bar to the start position. ",
        "strength": "In addition to being a welcome single-joint option, this pulldown also is versatile during a workout. It can be used as a heavy-weight strength-building exercise on its own or it can be used in pairing with a number of compound exercises as the tail end of a superset. (Good pairings include barbell rows, pull-ups, pulldowns and seated rows.) It also can be a final “burnout” exercise, going all out with high reps at the very end of a session.",
        "level": 1,
        "category": 2
    }
]